package days02;


/**
 * @author 정하영
 * @date 2023. 7. 14. - 오후 3:24:17
 * @subjct 음수표현
 * @contents 정수의 진법변환
 *                10-> /2     00000000 000001010
 *                실수의 진법변환
 *                       *2
 */
public class Ex13 {

	public static void main(String[] args) {
		// 정수 10                   0000 1010
		//'A'                          00000000 0100001
		//음수 -10               [] ?
		// [ 2의 보수법 ]
		// 1.음수 절대치       |-10| => 10
		//2. 1의 보수 
		//                               0000 1010
		//                               1111 0101
		//3. +1                                    1
		//                               1111 0110
		//예)
		// 0.625 x 2 =[1].25
		//0.25x 2     =[0].5
		//0.5   x2   =[1].0
		// 0.625 x 2  실수 ->0.101(2)
		
	}//main
}//class
